
//Задача 19
int a, N;

Console.Write("Задача 19: \n");
Console.Write("Программа, которая принимает на вход пятизначное число и проверяет, является ли оно палиндромом. \n");
Console.Write("Введите число: ");
int.TryParse(Console.ReadLine()!, out a);

if (a / 10000 != 0 && a / 10000 < 9)
{
    if (a / 10000 == a % 10 && (a / 1000 - a / 10000 * 10) == (a % 100 - a % 10) / 10)
    {
        Console.Write($"является ли число палиндромом: ДА\n");
    }
    else
    {
        Console.Write($"является ли число палиндромом: НЕТ\n");
    }
}
else
{
    Console.Write("Введено не пятизначное число\n");
}
Console.Write("=============================\n");

//==========================================================================================================
//==========================================================================================================

//Задача 21
Console.Write("Задача 21: \n");
Console.Write("Программа, которая принимает на вход координаты двух точек и находит расстояние между ними в 3D пространстве.\n");

int[] A_coord = new int[3];
int[] B_coord = new int[3];

Console.Write("Введите X координату первой точки: ");
int.TryParse(Console.ReadLine()!, out A_coord[0]);
Console.Write("Введите Y координату первой точки: ");
int.TryParse(Console.ReadLine()!, out A_coord[1]);
Console.Write("Введите Z координату первой точки: ");
int.TryParse(Console.ReadLine()!, out A_coord[2]);

Console.Write("Введите X координату второй точки: ");
int.TryParse(Console.ReadLine()!, out B_coord[0]);
Console.Write("Введите Y координату второй точки: ");
int.TryParse(Console.ReadLine()!, out B_coord[1]);
Console.Write("Введите Z координату второй точки: ");
int.TryParse(Console.ReadLine()!, out B_coord[2]);

int x = (A_coord[0] - B_coord[0]);
int y = (A_coord[1] - B_coord[1]);
int z = (A_coord[2] - B_coord[2]);


double distance = Math.Round(Math.Sqrt(x * x + y * y + z * z), 2);
Console.Write($"Расстояние между заданными (координатами) точками = {distance}\n");
Console.Write("=============================\n");

//==========================================================================================================
//==========================================================================================================

//Задача 23
Console.Write("Задача 23: \n");
Console.Write("Программа, которая принимает на вход число (N) и выдаёт таблицу кубов чисел от 1 до N. \n");
Console.Write("Введите число: ");
int.TryParse(Console.ReadLine()!, out N);


for (int i = 1; i < N; i++)
{
    Console.Write($"{i * i * i},");
}
Console.Write($"{N * N * N} \n");
Console.Write("=============================\n");

//==========================================================================================================
//==========================================================================================================
