//Задача 2
int a, b, c, i;
Console.Write("Задача 2: \n");
Console.Write("Программа, которая на вход принимает два числа и выдаёт, какое число большее, а какое меньшее \n");
Console.Write("Введите первое число: ");
int.TryParse(Console.ReadLine()!, out a);
Console.Write("Введите второе число: ");
int.TryParse(Console.ReadLine()!, out b);

if (a > b)
{ Console.Write($"Макимальное из введеных чисел max = {a}\n"); }
else
{ Console.Write($"Макимальное из введеных чисел max = {b}\n"); }
Console.Write("=============================\n");

//==========================================================================================================
//==========================================================================================================

//Задача 4
Console.Write("Задача 4: \n");
Console.Write("Программа, которая принимает на вход три числа и выдаёт максимальное из этих чисел\n");
Console.Write("Введите первое число: ");
int.TryParse(Console.ReadLine()!, out a);
Console.Write("Введите второе число: ");
int.TryParse(Console.ReadLine()!, out b);
Console.Write("Введите третье число: ");
int.TryParse(Console.ReadLine()!, out c);

if (a >= b)
{
    if (a > c)
    {
        Console.Write($"Макимальное из введеных чисел max = {a}\n");
    }
    else
    {
        Console.Write($"Макимальное из введеных чисел max = {c}\n");
    }
}
else
{
    if (b > c)
    {
        Console.Write($"Макимальное из введеных чисел max = {b}\n");
    }
    else
    {
        Console.Write($"Макимальное из введеных чисел max = {c}\n");
    }
}

Console.Write("=============================\n");

//==========================================================================================================
//==========================================================================================================

Console.Write("Задача 6: \n");
Console.Write("Программа, которая на вход принимает число и выдаёт, является ли число чётным (делится ли оно на два без остатка): \n");
Console.Write("Введите число: ");
int.TryParse(Console.ReadLine()!, out a);
Console.Write($"Введенное число {a} является четным: ");

if (a % 2 == 0)
{ Console.Write("Да \n"); }
else
{ Console.Write("Нет \n"); }
Console.Write("=============================\n");

//==========================================================================================================
//==========================================================================================================

Console.Write("Задача 8: \n");
Console.Write("Программа, которая на вход принимает число (N), а на выходе показывает все чётные числа от 1 до N: \n");
Console.Write("Введите натуральное число: ");
int.TryParse(Console.ReadLine()!, out a);

i = 0;
if (a > 0)
{
    Console.Write($"Все чётные числа от 1 до {a}: ");
    while (i < a)
    {
        i++;
        if (i % 2 == 0)
        { Console.Write($"{i} "); }

    }

}
else
{
    Console.Write("Вы ввели не натуральное число");
}